Codes d'exploitation/openFoam/caseFolder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*=========                 |
\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
 \    /   O peration     | Website:  https://openfoam.org
  \  /    A nd           | Version:  8
   \/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version     2.0;
	format      ascii;
	class       polyBoundaryMesh;
	object      boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
6
(
wall
		{
			type patch;
			nFaces 14760;
			startFace 810690;
		}
		inlet_0
		{
			type patch;
			nFaces 444;
			startFace 825450;
		}
		outlet_0
		{
			type patch;
			nFaces 444;
			startFace 825894;
		}
		outlet_1
		{
			type patch;
			nFaces 444;
			startFace 826338;
		}
		outlet_2
		{
			type patch;
			nFaces 444;
			startFace 826782;
		}
		outlet_3
		{
			type patch;
			nFaces 444;
			startFace 827226;
		}
		)

// ************************************************************************* //
