Codes d'exploitation/openFoam/caseFolder/0/U
/*--------------------------------*- C++ -*----------------------------------*=========                 |
\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
 \    /   O peration     | Website:  https://openfoam.org
  \  /    A nd           | Version:  8
   \/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version     2.0;
	format      ascii;
	class       volVectorField;
	object      U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions		[0 1 -1 0 0 0 0];

internalField		uniform (0 0 0);

boundaryField
{


	wall
	{
		type		noSlip;
	}

	inlet_0
	{
		type		fixedValue;
		value		uniform (-0.040766539233041 0.28229128290476563 -0.09300387559098);
	}

	outlet_0
	{
		type		zeroGradient;
	}

	outlet_1
	{
		type		zeroGradient;
	}

	outlet_2
	{
		type		zeroGradient;
	}

	outlet_3
	{
		type		zeroGradient;
	}

// ************************************************************************* //
