Codes d'exploitation/openFoam/caseFolder/0/p
/*--------------------------------*- C++ -*----------------------------------*=========                 |
\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
 \    /   O peration     | Website:  https://openfoam.org
  \  /    A nd           | Version:  8
   \/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version     2.0;
	format      ascii;
	class       volScalarField;
	object      p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions		[0 2 -2 0 0 0 0];

internalField		uniform 0;

boundaryField
{


	wall
	{
		type		zeroGradient;
	}

	inlet_0
	{
		type		zeroGradient;
	}

	outlet_0
	{
		type		fixedValue;
		value		uniform 0;
	}

	outlet_1
	{
		type		fixedValue;
		value		uniform 0;
	}

	outlet_2
	{
		type		fixedValue;
		value		uniform 0;
	}

	outlet_3
	{
		type		fixedValue;
		value		uniform 0;
	}

// ************************************************************************* //
