Codes d'exploitation/openFoam/caseFolder/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object decomposeParDict;
}

    numberOfSubdomains 12; // number of CPU cores to use
    method hierarchical;
    hierarchicalCoeffs
    {
        n (2 3 2); // number of division in the x, y and z directions number of subdomain = xsub*ysub*zsub
        delta 0.001;
        order yxz;
    }

    distributed false;
    roots
    (
    );
